# Task6

In [3]:
import numpy as np
import pandas as pd

In [15]:
#groupby
data = {
    'col1':['a','a','b','b','a'],
    'col2':['one','two','one','two','one'],
    'data1':[1,1,1,1,1],
    'data2':[2,2,2,2,2]
}
df = pd.DataFrame(data)
print(df)

  col1 col2  data1  data2
0    a  one      1      2
1    a  two      1      2
2    b  one      1      2
3    b  two      1      2
4    a  one      1      2

In [16]:
#把data1按col1列分组
group1 = df['data1'].groupby(df['col1'])
group1

In [17]:
group1.mean()#组间求平均

col1
a    1
b    1
Name: data1, dtype: int64

In [28]:
#把data2按col1,求平均值，列带着col2
group2 = df['data2'].groupby([df['col1'],df['col2']]).mean()
#col1，col2可以颠倒
group2

col1  col2
a     one     2
      two     2
b     one     2
      two     2
Name: data2, dtype: int64

In [29]:
#把上面一维多层次分类的，unstack到DataFrame格式看下
group2.unstack()

col2  one  two
col1
a       2    2
b       2    2

In [31]:
#分组大小，.size()
df.groupby(['col1']).size()
#a 3 b 2

col1
a    3
b    2
dtype: int64

In [32]:
df.groupby(['col2']).size()

col2
one    3
two    2
dtype: int64

In [34]:
df.groupby(['col1','col2']).size()
# a组有两个one，一个two
# b组有一个one,一个two
#注意，缺失值会被除去

col1  col2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [35]:
#迭代分组
for name,group in df.groupby('col1'):
    print(name)
    print(group)

a
  col1 col2  data1  data2
0    a  one      1      2
1    a  two      1      2
4    a  one      1      2
b
  col1 col2  data1  data2
2    b  one      1      2
3    b  two      1      2

In [38]:
#将上面分组组成一个字典
dictData = dict(list(df.groupby('col1')))
print(dictData)
print(dictData['a'])

{'a':   col1 col2  data1  data2
0    a  one      1      2
1    a  two      1      2
4    a  one      1      2, 'b':   col1 col2  data1  data2
2    b  one      1      2
3    b  two      1      2}
  col1 col2  data1  data2
0    a  one      1      2
1    a  two      1      2
4    a  one      1      2

In [42]:
#取列的数据类型分组
group3 = df.groupby(df.dtypes,axis=1)
for dtype,group in group3:
    print(dtype)
    print(group)

int64
   data1  data2
0      1      2
1      1      2
2      1      2
3      1      2
4      1      2
object
  col1 col2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [54]:
#选取分组中的某列
data2 = df.groupby('col1')['data1']
for name,group in data2:
    print(name)
    print(group)

a
0    1
1    1
4    1
Name: data1, dtype: int64
b
2    1
3    1
Name: data1, dtype: int64

In [55]:
data3 = df.groupby('col1')[['data2']]
for name,group in data3:
    print(name)
    print(group)

a
  col1 col2  data1  data2
0    a  one      1      2
1    a  two      1      2
4    a  one      1      2
b
  col1 col2  data1  data2
2    b  one      1      2
3    b  two      1      2

In [59]:
#对分组数据做计算，聚合，求平均
df.groupby(['col1','col2'])[['data2']].mean()

           data2
col1 col2
a    one       2
     two       2
b    one       2
     two       2

In [60]:
df.groupby(['col1','col2'])['data2'].mean()

col1  col2
a     one     2
      two     2
b     one     2
      two     2
Name: data2, dtype: int64

In [ ]:
#通过字典或series分组===>>>==图 6980

In [61]:
#通过函数分组 ===》》》图6982

In [62]:
#通过索引分组 ===》》》图6982

In [63]:
#数据聚合(分组后做一些计算)
#count sum mean median std,var 标准差 方差 min,max prod非NA值的积 first last 第一个和最后一个非NA值
#quantile()? 6984

In [90]:
#自定义聚合函数 传入aggregate 或agg

data = {
    'col1':['a','a','b','b','a'],
    'col2':['one','two','one','two','one'],
    'data1':[1,2,3,4,5],
    'data2':[2,4,6,8,10]
}
df2 = pd.DataFrame(data)
group2 = df2.groupby(['col1','col2'])

for name,group in group2:
    print(name)
    print(group)
    
def myFn(data):
    return data.max() - data.min()
    #return (data,"1111")
group2.agg(myFn)
#//a组one data1最大值5 - 最小值1 = 4， data2 =8

('a', 'one')
  col1 col2  data1  data2
0    a  one      1      2
4    a  one      5     10
('a', 'two')
  col1 col2  data1  data2
1    a  two      2      4
('b', 'one')
  col1 col2  data1  data2
2    b  one      3      6
('b', 'two')
  col1 col2  data1  data2
3    b  two      4      8

           data1  data2
col1 col2
a    one       4      8
     two       0      0
b    one       0      0
     two       0      0

In [87]:
#看详细 统计量
df2.groupby(['col1','col2']).describe()

          data1                                         data2                 \
          count mean       std  min  25%  50%  75%  max count mean       std
col1 col2
a    one    2.0  3.0  2.828427  1.0  2.0  3.0  4.0  5.0   2.0  6.0  5.656854
     two    1.0  2.0       NaN  2.0  2.0  2.0  2.0  2.0   1.0  4.0       NaN
b    one    1.0  3.0       NaN  3.0  3.0  3.0  3.0  3.0   1.0  6.0       NaN
     two    1.0  4.0       NaN  4.0  4.0  4.0  4.0  4.0   1.0  8.0       NaN


           min  25%  50%  75%   max
col1 col2
a    one   2.0  4.0  6.0  8.0  10.0
     two   4.0  4.0  4.0  4.0   4.0
b    one   6.0  6.0  6.0  6.0   6.0
     two   8.0  8.0  8.0  8.0   8.0

In [91]:
#面向列的多函数应用===》》》==图6986